### Team 2: China's K12 Online Education Data Management System

Insert data into Cassandra by using cassandra-driver in python

In [7]:
pip install cassandra-driver

Collecting cassandra-driver
  Downloading https://files.pythonhosted.org/packages/5c/85/2b87a18870e6c457a762cea58920a42c5d357b3e9ef3a6f94b978429ec15/cassandra_driver-3.25.0-cp37-cp37m-manylinux1_x86_64.whl (3.8MB)
     |████████████████████████████████| 3.8MB 6.4MB/s
Collecting geomet<0.3,>=0.1
  Downloading https://files.pythonhosted.org/packages/c9/81/156ca48f950f833ddc392f8e3677ca50a18cb9d5db38ccb4ecea55a9303f/geomet-0.2.1.post1-py3-none-any.whl
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from cassandra-driver) (1.15.0)
Requirement already satisfied: click in /usr/local/lib/python3.7/dist-packages (from geomet<0.3,>=0.1->cassandra-driver) (7.1.2)
Installing collected packages: geomet, cassandra-driver
Successfully installed cassandra-driver-3.25.0 geomet-0.2.1.post1

In [5]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [8]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider
import pandas as pd

### Connect to the Cassandra on datastax

In [9]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

cloud_config= {
        'secure_connect_bundle': '/content/drive/MyDrive/INFO7275_Advanced_DB/secure-connect-db-info7275.zip'
}

auth_provider = PlainTextAuthProvider('yangjiaoli@gmail.com', 'NEUinfo7275!')

cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

row = session.execute("select release_version from system.local").one()
if row:
    print(row[0])
else:
    print("An error occurred.")

4.0.0.6811

set keyspace "my_keyspace"

In [10]:
try:
    session.set_keyspace("info7275")
except Exception as e:
    print(e)

### Create table

1.online platform table

In [ ]:
tb_platform = """Create table If not exists platform(
                                                    platform_id text,
                                                    platform_name text,
                                                    platform_url text,PRIMARY KEY(platform_id))"""
try:
    rows = session.execute(tb_platform)
except Exception as e:
    print(e)

2.Grade table

In [ ]:
tb_grade = "Create table If not exists grade(grade_id text,grade_name text,PRIMARY KEY(grade_id))"
try:
    rows = session.execute(tb_grade)
except Exception as e:
    print(e)

3.Suject table

In [ ]:
tb_subject = """Create table If not exists subject(subject_id text,
                                                    subject_name text,
                                                    subject_name_eng text,
                                                    PRIMARY KEY(subject_id))"""
try:
    rows = session.execute(tb_subject)
except Exception as e:
    print(e)

errors={'e56ade3b-8c5a-445a-bda9-a2208aebce33-us-east-1.db.astra.datastax.com:29042:8d378dba-7367-44a9-9bd5-6c2196dc95fc': 'Client request timeout. See Session.execute[_async](timeout)'}, last_host=e56ade3b-8c5a-445a-bda9-a2208aebce33-us-east-1.db.astra.datastax.com:29042:8d378dba-7367-44a9-9bd5-6c2196dc95fc

3.Course table

In [31]:
tb_course = """Create table If not exists course(
                                                course_id text,
                                                course_name text,
                                                start_time text,
                                                end_time text,
                                                lesson_num text,
                                                teacher_id text,
                                                grade_id text,
                                                subject_id text,
                                                platform_id  text,
                                                run_id text,
                                                PRIMARY KEY(course_id))"""
try:
    rows = session.execute(tb_course)
except Exception as e:
    print(e)

4.Teacher table

In [12]:
tb_teacher = """Create table If not exists teacher(teacher_id text,
                                                    teacher_name text,
                                                    teacher_introduce text,
                                                    PRIMARY KEY(teacher_id))"""
try:
    rows = session.execute(tb_teacher)
except Exception as e:
    print(e)

5.AssistantTeacher table

In [ ]:
tb_assistantTeacher = """Create table If not exists assistantteacher(assistantteacher_id text,
                                                                    teacher_id text,
                                                                    assistantteacher_name text,
                                                                    PRIMARY KEY(assistantteacher_id))"""
try:
    rows = session.execute(tb_assistantTeacher)
except Exception as e:
    print(e)

6.CourseReview table

In [ ]:
tb_course_review = """Create table If not exists course_review(course_id text,
                                                ranking int,
                                                reviews text, 
                                                PRIMARY KEY(course_id))"""
try:
    rows = session.execute(tb_course_review)
except Exception as e:
    print(e)

7.TeacherReview table

In [ ]:
tb_teacher_review = """Create table If not exists teacher_review(teacher_id text,
                                                    ranking int,
                                                    review text,
                                                    PRIMARY KEY(teacher_id))"""
try:
    rows = session.execute(tb_teacher_review)
except Exception as e:
    print(e)

8.AssistantTeacherReview table

In [ ]:
tb_assistntTeacher_review = """Create table If not exists assistantteacher_review(assistantteacher_id text,
                                                    ranking int,
                                                    review text,
                                                    PRIMARY KEY(teacher_id))"""
try:
    rows = session.execute(tb_teacher_review)
except Exception as e:
    print(e)

9.Sales Table

In [25]:
tb_sales = """Create table If not exists sales(
                                                course_id text, 
                                                price text,          
                                                original_price text,   
                                                quantity text,       
                                                sold_count text,      
                                                pre_sale_time text,   
                                                start_sale_time text,
                                                end_sale_time text,
                                                left_count text, 
                                                sold_out text,                          
                                                PRIMARY KEY(course_id))"""
try:
    rows = session.execute(tb_sales)
except Exception as e:
    print(e)

### Insert data

In [ ]:
import numpy as np

1.insert online platform table

In [ ]:
online_platform = pd.DataFrame(np.array([['1', "yuanfudao", "https://www.yuanfudao.com/"], 
                                         ['2', "genshuixue","https://www.genshuixue.com/"], 
                                         ['3', "youdao", "https://ke.youdao.com/"]]),
                               columns=['platform_id', 'platform_name', 'platform_url'])

online_platform

  platform_id platform_name                 platform_url
0           1     yuanfudao   https://www.yuanfudao.com/
1           2    genshuixue  https://www.genshuixue.com/
2           3        youdao       https://ke.youdao.com/

In [ ]:
for index, platform_column in online_platform.iterrows():
    try:
        query = """INSERT INTO platform (
                                        platform_id,
                                        platform_name,
                                        platform_url) 
                                        VALUES ('{0}', '{1}','{2}');""".format(platform_column['platform_id'],platform_column['platform_name'],platform_column['platform_url'])
        session.execute(query)
    except Exception as e:
        print(e)

2.insert grade table;

In [ ]:
grade_info = pd.read_excel('/content/drive/MyDrive/INFO7275_Advanced_DB/dataset/grade_list.xlsx')
grade_info.head()

   grade_id grade_name
0         1        一年级
1         2        二年级
2         3        三年级
3         4        四年级
4         5        五年级

In [ ]:
for index, tmp_row in grade_info.iterrows():
    try:
        query = """INSERT INTO grade(
                                    grade_id,
                                    grade_name)
                                    VALUES ('{0}', '{1}');""".format(tmp_row['grade_id'],tmp_row['grade_name'])
        session.execute(query)
    except Exception as e:
        print(e)

3.subject table

In [ ]:
subject_info = pd.read_excel('/content/drive/MyDrive/INFO7275_Advanced_DB/dataset/subject_list.xlsx')
subject_info.head(3)

   subject_id subject_name subject_name_eng
0           9           数学             math
1           1           政治         politics
2           2           地理        geography

In [ ]:
for index, tmp_row in subject_info.iterrows():
    try:
        query = """INSERT INTO subject(
                                    subject_id,
                                    subject_name,
                                    subject_name_eng)
                                    VALUES ('{0}', '{1}','{2}');""".format(tmp_row['subject_id'],tmp_row['subject_name'],tmp_row['subject_name_eng'])
        session.execute(query)
    except Exception as e:
        print(e)

4.Teacher table

In [13]:
import pandas as pd
import numpy as np

In [14]:
teacher_info= pd.read_excel('/content/drive/MyDrive/INFO7275_Advanced_DB/dataset/teacher_info.xlsx')
teacher_info.head()

   teacher_id teacher_name
0           0           刘薇
1           1           程磊
2           2           严攀
3           4           斯琴
4           5          满晓桐

In [15]:
for index, tmp_row in teacher_info.iterrows():
    try:
        query = """INSERT INTO teacher(
                                    teacher_id,
                                    teacher_name)
                                    VALUES ('{0}', '{1}');""".format(tmp_row['teacher_id'],tmp_row['teacher_name'])
        session.execute(query)
    except Exception as e:
        print(e)

5.Course Sales table

In [19]:
sales_info = pd.read_excel('/content/drive/MyDrive/INFO7275_Advanced_DB/dataset/sales_info.xlsx')
sales_info.head(3)

   course_id  price  original_price  ...  end_sale_time  left_count sold_out
0    3511191      9             299  ...     2020-03-01          73        0
1    3163273   1200               0  ...     2020-04-07           4        0
2    3163275   1200               0  ...     2020-04-07           9        0

[3 rows x 10 columns]

In [27]:
for index, tmp_row in sales_info.iterrows():
    try:
        query = """INSERT INTO sales(
                                        course_id, 
                                        price,          
                                        original_price,   
                                        quantity,       
                                        sold_count,      
                                        pre_sale_time,   
                                        start_sale_time,
                                        end_sale_time,
                                        left_count, 
                                        sold_out)
                                        VALUES ('{0}', '{1}', '{2}', '{3}', '{4}', '{5}', '{6}', '{7}','{8}','{9}');""".format(tmp_row['course_id'],tmp_row['price'],
                                                                                                                       tmp_row['original_price'],tmp_row['quantity'],
                                                                                                                       tmp_row['sold_count'],tmp_row['pre_sale_time'],
                                                                                                                       tmp_row['start_sale_time'],tmp_row['end_sale_time'],
                                                                                                                       tmp_row['left_count'],tmp_row['sold_out'])
        session.execute(query)
    except Exception as e:
        print(e)

6.Course Table

In [32]:
course_info = pd.read_excel('/content/drive/MyDrive/INFO7275_Advanced_DB/dataset/course_yuanfudao_info.xlsx')
course_info.head(3)

   grade_id  course_id         course_name  ... teacher_id subject_id  platform_id
0         7    3511191         初一语文题型技巧特训班  ...       46.0        8.0            1
1         7    3163273  初一语文春季系统班（周五18:00）  ...       46.0        8.0            1
2         7    3163275  初一语文春季系统班（周六09:00）  ...       46.0        8.0            1

[3 rows x 10 columns]

In [34]:
for index, tmp_row in course_info.iterrows():
    try:
        query = """INSERT INTO course(
                                    course_id,
                                    course_name,
                                    start_time,
                                    end_time,
                                    lesson_num,
                                    teacher_id,
                                    grade_id,
                                    subject_id,
                                    platform_id,
                                    run_id)
                                    VALUES ('{0}', '{1}', '{2}', '{3}', '{4}', '{5}', '{6}', '{7}','{8}','{9}');""".format(tmp_row['course_id'],tmp_row['course_name'],
                                                                                                                       tmp_row['start_time'],tmp_row['end_time'],
                                                                                                                       tmp_row['lesson_num'],tmp_row['teacher_id'],
                                                                                                                       tmp_row['grade_id'],tmp_row['subject_id'],
                                                                                                                       tmp_row['platform_id'],tmp_row['run_id'])
        session.execute(query)
    except Exception as e:
        print(e)